
import 'package:test_1/game2/lib/models/game_questions.dart';

const questions = [
  GameQuestions("كم عدد الايام في الاسبوع؟", [
    "7",
    "3",
    "5",
    "2",
  ]),
    GameQuestions("ماذا يجب أن تفعل عندما تقابل شخص جديد؟", [
    "تصافحه ",
    "تتجاهله",
    "تصرخ",
    "تركض بعيداً",
  ]),
    GameQuestions(" كم عدد ارجل القطه؟", [
    "4",
    "3",
    "7",
    "2",
  ]),
    GameQuestions("اذا كان صديقك يشعر بالحزن، كيف يمكنك مساعدته؟", [
    "تستمع إليه عندما يتحدث",
    "تتركه وحيداً",
    "تلعب بعيداً عنه",
    "لا تفعل شيء",
  ]),
    GameQuestions("اذا كان لديك 50 ريالاً، واشتريت بقيمة 25 ريالاً، كم تبقى معك؟", [
    "25",
    "30",
    "10",
    "50",
  ]),
    GameQuestions("كم عدد العجلات في السيارة العادية؟ ", [
    "4",
    "3",
    "2",
    "5",
  ])
];